.doom.d/config.org
* Set name and email address
#+begin_src emacs-lisp

(setq user-full-name "Bento Carlos"
      user-mail-address "bcsilva49@gmail.com")
#+end_src

* Set font

#+begin_src emacs-lisp

(setq doom-font (font-spec :family "FantasqueSansMono Nerd Font Mono" :size 18))

#+end_src

* Set theme
#+begin_src emacs-lisp

(setq doom-theme 'doom-xcode)

#+end_src

* Org files directory
#+begin_src emacs-lisp

(setq org-directory "~/org/")

#+end_src

* Line numbers style
#+begin_src emacs-lisp

(setq display-line-numbers-type t)

#+end_src

* Add transparency
#+begin_src emacs-lisp

(set-frame-parameter (selected-frame) 'alpha '(95 . 50))
(add-to-list 'default-frame-alist '(alpha . (95 . 50)))

#+end_src

* Start maximized
#+begin_src emacs-lisp

(add-to-list 'default-frame-alist '(fullscreen . maximized))

#+end_src

* Change tab size
#+begin_src emacs-lisp

(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
(setq indent-line-function 'insert-tab)

#+end_src

* Replace dartfmt with dart format
#+begin_src emacs-lisp

(setq-default format-all-formatters '(("Dart" dart-format)))

#+end_src

* Rainbow-delimiters
#+begin_src emacs-lisp

(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)

#+end_src

* Enable tab completion
#+begin_src emacs-lisp
(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
 :ensure t
 :hook (company-mode . company-box-mode))

#+end_src

* Javascript

#+begin_src emacs-lisp
(setq exec-path (append exec-path '("C:\\Program Files\\nodejs")))
#+end_src

* Tide
#+begin_src emacs-lisp
(use-package tide
  :ensure t
  :after (typescript-mode company flycheck)
  :hook ((typescript-mode . tide-setup)
         (typescript-mode . tide-hl-identifier-mode)
         (before-save . tide-format-before-save)))
#+end_src
